
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>2. 아키텍쳐 개요 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../../gitbook/gitbook-plugin-collapse/collapse.css">
                
            
                
                <link rel="stylesheet" href="../../../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../../../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../../../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../../gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="1.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../../../">
            
                <a href="../../../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../../backend/">
            
                <a href="../../backend/">
            
                    
                    Backend
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../../frontend/">
            
                <a href="../../frontend/">
            
                    
                    Frontend
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../">
            
                <a href="../">
            
                    
                    Architecture
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="./">
            
                <a href="./">
            
                    
                    DDD Start!
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1.1" data-path="1.html">
            
                <a href="1.html">
            
                    
                    1. 도메인 모델 시작
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.4.1.2" data-path="2.html">
            
                <a href="2.html">
            
                    
                    2. 아키텍쳐 개요
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.1.3" >
            
                <span>
            
                    
                    3. 애그리거트
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.1.4" >
            
                <span>
            
                    
                    4. 리포지터리와 모델구현(JPA 중심)
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.1.5" >
            
                <span>
            
                    
                    5. 리포지터리와 조회 기능(JPA 중심)
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.1.6" >
            
                <span>
            
                    
                    6. 응용 서비스와 표현 영역
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.1.7" >
            
                <span>
            
                    
                    7. 도메인 서비스
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.1.8" >
            
                <span>
            
                    
                    8. 애그리거트 트랜잭션 관리
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.1.9" >
            
                <span>
            
                    
                    9. 도메인 모델과 BOUNDED CONTEXT
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.1.10" >
            
                <span>
            
                    
                    10. 이벤트
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.1.11" >
            
                <span>
            
                    
                    11. CQRS
            
                </span>
            

            
        </li>
    

            </ul>
            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="../../better-developer/">
            
                <a href="../../better-developer/">
            
                    
                    Better Developer
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="../../better-developer/the-art-of-readable-code/">
            
                <a href="../../better-developer/the-art-of-readable-code/">
            
                    
                    읽기 좋은 코드가 좋은 코드다
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1.1" data-path="../../better-developer/the-art-of-readable-code/">
            
                <a href="../../better-developer/the-art-of-readable-code/">
            
                    
                    1. 코드는 이해하기 쉬워야 한다.
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.1.2" >
            
                <span>
            
                    
                    2. 이름에 정보 담기
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.1.3" >
            
                <span>
            
                    
                    3. 오해할 수 없는 이름들
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.1.4" >
            
                <span>
            
                    
                    4. 미학
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.1.5" >
            
                <span>
            
                    
                    5. 주석에 담아야 하는 대상
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.1.6" >
            
                <span>
            
                    
                    6 명확하고 간결한 주석 달기
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.1.7" >
            
                <span>
            
                    
                    7. 읽기 쉽게 흐름제어 만들기
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.1.8" >
            
                <span>
            
                    
                    8. 거대한 표현을 잘게 쪼개기
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.1.9" >
            
                <span>
            
                    
                    9. 변수와 가독성
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.1.10" >
            
                <span>
            
                    
                    10. 상관없는 하위문제 추출하기
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.1.11" >
            
                <span>
            
                    
                    11. 한 번에 하나씩
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.1.12" >
            
                <span>
            
                    
                    12. 생각을 코드로 만들기
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.1.13" >
            
                <span>
            
                    
                    13. 코드 분량 줄이기
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.1.14" >
            
                <span>
            
                    
                    14. 테스트와 가독성
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.1.15" >
            
                <span>
            
                    
                    15. '분/시간 카운터'를 설계하고 구현하기
            
                </span>
            

            
        </li>
    

            </ul>
            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../../.." >2. 아키텍쳐 개요</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="2-&#xC544;&#xD0A4;&#xD14D;&#xCCD0;-&#xAC1C;&#xC694;">2. &#xC544;&#xD0A4;&#xD14D;&#xCCD0; &#xAC1C;&#xC694;</h1>
<h2 id="&#xB3C4;&#xBA54;&#xC778;-&#xC601;&#xC5ED;&#xC758;-&#xC8FC;&#xC694;-&#xAD6C;&#xC131;&#xC694;&#xC18C;">&#xB3C4;&#xBA54;&#xC778; &#xC601;&#xC5ED;&#xC758; &#xC8FC;&#xC694; &#xAD6C;&#xC131;&#xC694;&#xC18C;</h2>
<p>&#xB3C4;&#xBA54;&#xC778; &#xC601;&#xC5ED;&#xC740; DDD&#xC758; &#xD575;&#xC2EC;&#xC778; &#xB3C4;&#xBA54;&#xC778;&#xC758; &#xAC1C;&#xB150;&#xC744; &#xD45C;&#xD604;&#xD558;&#xACE0; &#xAD6C;&#xD604;&#xD55C;&#xB2E4;.</p>
<ul>
<li>&#xC5D4;&#xD2F0;&#xD2F0; (ENTITY) : &#xB3C4;&#xBA54;&#xC778;&#xC758; &#xACE0;&#xC720;&#xD55C; &#xAC1C;&#xB150;&#xC744; &#xD45C;&#xD604;. &#xB370;&#xC774;&#xD130;&#xC640; &#xAD00;&#xB828; &#xAE30;&#xB2A5;&#xC744; &#xC81C;&#xACF5;&#xD55C;&#xB2E4;. &#xC2DD;&#xBCC4;&#xC790;&#xC640; &#xB77C;&#xC774;&#xD504;&#xC0AC;&#xC774;&#xD074;&#xC744; &#xAC00;&#xC9D0;</li>
<li>&#xBC38;&#xB958; (VALUE) : &#xB3C4;&#xBA54;&#xC778; &#xBAA8;&#xB378;&#xC5D0;&#xC11C; &#xAC1C;&#xB150;&#xC801;&#xC73C;&#xB85C; &#xD45C;&#xD604;&#xB420; &#xC218; &#xC788;&#xB294; &#xC18D;&#xC131;. &#xC2DD;&#xBCC4;&#xC790;&#xB97C; &#xAC16;&#xC9C0; &#xC54A;&#xACE0; &#xC8FC;&#xB85C; &#xC5D4;&#xD2F0;&#xD2F0;&#xC758; &#xC18D;&#xC131;&#xC73C;&#xB85C; &#xC0AC;&#xC6A9;&#xB428;</li>
<li>&#xC560;&#xADF8;&#xB9AC;&#xAC70;&#xD2B8; (AGGREGATE) : &#xC5EC;&#xB7EC; &#xC5D4;&#xD2F0;&#xD2F0;&#xC640; &#xBC38;&#xB958; &#xAC1D;&#xCCB4;&#xB97C; &#xAC1C;&#xB150;&#xC801;&#xC73C;&#xB85C; &#xD558;&#xB098;&#xB85C; &#xBB36;&#xC740; &#xAC83;. &#xC608;&#xB97C;&#xB4E4;&#xC5B4; <code>&#xC8FC;&#xBB38;</code> &#xB3C4;&#xBA54;&#xC778;&#xC740; &#xC8FC;&#xBB38; &#xC5D4;&#xD2F0;&#xD2F0;, &#xC8FC;&#xBB38; &#xD56D;&#xBAA9; &#xC5D4;&#xD2F0;&#xD2F0;, &#xC8FC;&#xBB38;&#xC790; &#xC5D4;&#xD2F0;&#xD2F0;&#xB97C; <code>&#xC8FC;&#xBB38;</code> &#xC560;&#xADF8;&#xB9AC;&#xAC70;&#xD2B8;&#xB85C; &#xBB36;&#xC744;&#xC218;&#xC788;&#xC74C;</li>
<li>&#xB9AC;&#xD3EC;&#xC9C0;&#xD130;&#xB9AC; (REPOSITORY) : &#xB3C4;&#xBA54;&#xC778; &#xBAA8;&#xB378;&#xC758; &#xC601;&#xC18D;&#xC131;&#xC744; &#xCC98;&#xB9AC;. &#xB300;&#xD45C;&#xC801;&#xC73C;&#xB85C; DBMS&#xC5D0; &#xC800;&#xC7A5;, &#xC870;&#xD68C;&#xD558;&#xB294; &#xC5ED;&#xD560;&#xC744; &#xB2F4;&#xB2F9; </li>
<li>&#xB3C4;&#xBA54;&#xC778; &#xC11C;&#xBE44;&#xC2A4; (DOMAIN SERVICE) : &#xD2B9;&#xC815; &#xC5D4;&#xD2F0;&#xD2F0;&#xC5D0; &#xC18D;&#xD558;&#xC9C0; &#xC54A;&#xC740; &#xB3C4;&#xBA54;&#xC778; &#xB85C;&#xC9C1;&#xC744; &#xC81C;&#xACF5;. &#xC608;&#xB97C;&#xB4E4;&#xC5B4; <code>&#xD560;&#xC778; &#xAE08;&#xC561; &#xACC4;&#xC0B0;</code> &#xAE30;&#xB2A5;&#xC740; &#xC0C1;&#xD488;, &#xCFE0;&#xD3F0;, &#xD68C;&#xC6D0; &#xB4F1;&#xAE09; &#xAD6C;&#xB9E4; &#xAE08;&#xC561; &#xB4F1; &#xC5EC;&#xB7EC; &#xC5D4;&#xD2F0;&#xD2F0;&#xC640; &#xBC38;&#xB958;&#xB97C; &#xD544;&#xC694;&#xB85C; &#xD558;&#xB294;&#xB370; &#xC774;&#xB7F4; &#xB54C; &#xB3C4;&#xBA54;&#xC778; &#xC11C;&#xBE44;&#xC2A4;&#xB97C; &#xD1B5;&#xD574; &#xAE30;&#xB2A5;&#xC744; &#xAD6C;&#xD604;</li>
</ul>
<h4 id="&#xC5D4;&#xD2F0;&#xD2F0;&#xC640;-&#xBC38;&#xB958;">&#xC5D4;&#xD2F0;&#xD2F0;&#xC640; &#xBC38;&#xB958;</h4>
<p>&#xB3C4;&#xBA54;&#xC778; &#xBAA8;&#xB378;&#xC758; &#xC5D4;&#xD2F0;&#xD2F0;&#xB97C; &#xB370;&#xC774;&#xD130;&#xBCA0;&#xC774;&#xC2A4;&#xC758; &#xC5D4;&#xD2F0;&#xD2F0;&#xC640; &#xD63C;&#xB3D9;&#xD558;&#xAE30; &#xC26C;&#xC6B4;&#xB370;, &#xB458;&#xC740; &#xC911;&#xC694;&#xD55C; &#xCC28;&#xC774;&#xC810;&#xC744; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xB2E4;.</p>
<ul>
<li>DB &#xC5D4;&#xD2F0;&#xD2F0;&#xAC00; &#xD574;&#xB2F9; &#xAC1C;&#xB150;&#xC758; &#xB370;&#xC774;&#xD130;&#xB9CC; &#xD45C;&#xD604;&#xD558;&#xB294; &#xBC18;&#xBA74; &#xB3C4;&#xBA54;&#xC778; &#xBAA8;&#xB378;&#xC758; &#xC5D4;&#xD2F0;&#xD2F0;&#xB294; &#xB370;&#xC774;&#xD130; &#xBFD0;&#xB9CC; &#xC544;&#xB2C8;&#xB77C; <strong><em>&#xB3C4;&#xBA54;&#xC778; &#xAE30;&#xB2A5;&#xC744; &#xD568;&#xAED8; &#xC81C;&#xACF5;</em></strong></li>
<li>DB &#xC5D4;&#xD2F0;&#xD2F0;&#xB294; &#xC18D;&#xC131;&#xC744; &#xCEEC;&#xB7FC;&#xC73C;&#xB85C; &#xBC16;&#xC5D0; &#xD45C;&#xD604;&#xD560; &#xC218; &#xC5C6;&#xB294;&#xB370; &#xB3C4;&#xBA54;&#xC778; &#xBAA8;&#xB378;&#xC758; &#xC5D4;&#xD2F0;&#xD2F0;&#xB294; &#xBC38;&#xB958; &#xD0C0;&#xC785;&#xC744; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xB2E4;.<ul>
<li>&#xBB3C;&#xB860; DB&#xC5D0;&#xC11C;&#xB3C4; &#xAD00;&#xB828; &#xB370;&#xC774;&#xD130;&#xB97C; &#xBB36;&#xC5B4; &#xBCC4;&#xB3C4; &#xD14C;&#xC774;&#xBE14;&#xB85C; &#xBD84;&#xB9AC;&#xD560; &#xC218; &#xC788;&#xC9C0;&#xB9CC;, &#xBC38;&#xB958; &#xD0C0;&#xC785;&#xC758; &#xC758;&#xBBF8;&#xAC00; &#xB4DC;&#xB7EC;&#xB098;&#xC9C0; &#xC54A;&#xC74C;</li>
<li>&#xBC38;&#xB958; &#xD0C0;&#xC785;&#xC5D0;&#xC11C; <code>&#xBCC0;&#xACBD;</code>&#xC774;&#xB780; &#xBC38;&#xB958; &#xAC1D;&#xCCB4; &#xC790;&#xCCB4;&#xB97C; &#xAD50;&#xCCB4;&#xD558;&#xB294;&#xAC74;&#xB370;, &#xD14C;&#xC774;&#xBE14; &#xBD84;&#xB9AC;&#xB77C;&#xBA74; &#xAC12; &#xBCC0;&#xACBD;&#xC77C; &#xBFD0;&#xC774;&#xACE0; &#xC774;&#xB294; &#xBC38;&#xD29C; &#xD0C0;&#xC785; &#xAD6C;&#xD604;&#xC5D0; &#xAD8C;&#xC7A5;&#xB418;&#xB294; &#xBC29;&#xBC95;&#xC778; <code>&#xBD88;&#xBCC0;</code>&#xC5D0; &#xC704;&#xBC30;&#xB428;</li>
</ul>
</li>
</ul>
<h5 id="&#xB370;&#xC774;&#xD130;&#xBCA0;&#xC774;&#xC2A4;-&#xC5D4;&#xD2F0;&#xD2F0;">&#xB370;&#xC774;&#xD130;&#xBCA0;&#xC774;&#xC2A4; &#xC5D4;&#xD2F0;&#xD2F0;</h5>
<blockquote>
<p>&#xB370;&#xC774;&#xD0C0;&#xBCA0;&#xC774;&#xC2A4; &#xBD84;&#xC57C;&#xC5D0;&#xC11C; &#xAC1C;&#xCCB4; &#xB610;&#xB294; &#xC5D4;&#xD2F0;&#xD2F0;(Entity)&#xB77C;&#xACE0; &#xD558;&#xB294; &#xAC83;&#xC740; &#xB370;&#xC774;&#xD0C0;&#xBCA0;&#xC774;&#xC2A4;&#xC5D0; &#xD45C;&#xD604;&#xD558;&#xB824;&#xACE0; &#xD558;&#xB294; &#xC720;&#xD615;, &#xBB34;&#xD615;&#xC758; &#xAC1D;&#xCCB4;&#xB85C;&#xC11C; &#xC11C;&#xB85C; &#xAD6C;&#xBCC4;&#xB418;&#xB294; &#xAC83;&#xC744; &#xB73B;&#xD55C;&#xB2E4;. &#xC774; &#xAC1C;&#xCCB4;&#xB294; &#xD604;&#xC2E4; &#xC138;&#xACC4;&#xC5D0; &#xB300;&#xD574; &#xC0AC;&#xB78C;&#xC774; &#xC0DD;&#xAC01;&#xD558;&#xB294; &#xAC1C;&#xB150;&#xC774;&#xB098; &#xC815;&#xBCF4;&#xC758; &#xB2E8;&#xC704;&#xB85C;&#xC11C; &#xC758;&#xBBF8;&#xB97C; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xB2E4;. &#xC774;&#xAC83;&#xC740; &#xCEF4;&#xD4E8;&#xD130;&#xAC00; &#xCDE8;&#xAE09;&#xD558;&#xB294; &#xD654;&#xC77C;&#xC758; &#xB808;&#xCF54;&#xB4DC;(record)&#xC5D0; &#xB300;&#xC751;&#xD55C;&#xB2E4;. &#xC774; &#xAC1C;&#xCCB4;&#xB294; &#xADF8; &#xB2E8;&#xB3C5;&#xC73C;&#xB85C; &#xC874;&#xC7AC;&#xD560; &#xC218; &#xC788;&#xC73C;&#xBA70;, &#xC815;&#xBCF4;&#xB85C;&#xC11C;&#xC758; &#xC5ED;&#xD560;&#xC744; &#xD55C;&#xB2E4;. &#xD558;&#xB098;&#xC758; &#xAC1C;&#xCCB4;&#xB294; &#xD558;&#xB098; &#xC774;&#xC0C1;&#xC758; &#xC18D;&#xC131;, &#xC989; &#xC560;&#xD2B8;&#xB9AC;&#xBDF0;&#xD2B8;(attribute)&#xB85C; &#xAD6C;&#xC131;&#xB418;&#xACE0; &#xAC01; &#xC18D;&#xC131;&#xC740; &#xADF8; &#xAC1C;&#xCCB4;&#xC758; &#xD2B9;&#xC131;&#xC774;&#xB098; &#xC0C1;&#xD0DC;&#xB97C; &#xAE30;&#xC220;&#xD574; &#xC900;&#xB2E4;.</p>
</blockquote>
<h4 id="&#xC560;&#xADF8;&#xB9AC;&#xAC70;&#xD2B8;">&#xC560;&#xADF8;&#xB9AC;&#xAC70;&#xD2B8;</h4>
<ul>
<li>&#xB3C4;&#xBA54;&#xC778;&#xC774; &#xCEE4;&#xC9C8;&#xC218;&#xB85D; &#xADF8;&#xB97C; &#xD45C;&#xD604;&#xD558;&#xAE30; &#xC704;&#xD574; &#xC5D4;&#xD2F0;&#xD2F0;&#xC640; &#xBC38;&#xB958;&#xB4E4;&#xC774; &#xB9CE;&#xC544;&#xC9C4;&#xB2E4;. </li>
<li>&#xAC2F;&#xC218;&#xC57C; &#xC911;&#xC694;&#xD55C;&#xAC8C; &#xC544;&#xB2C8;&#xC9C0;&#xB9CC;, &#xB3C4;&#xBA54;&#xC778; &#xBAA8;&#xB378;&#xC774; &#xCEE4;&#xC9C0;&#xB9CC; &#xAC1C;&#xBC1C;&#xC790;&#xB294; &#xC804;&#xCCB4; &#xADF8;&#xB9BC;&#xC774; &#xC544;&#xB2CC; &#xAD6D;&#xC9C0;&#xC801;&#xC778; &#xBD80;&#xBD84;&#xC5D0; &#xC9D1;&#xC911;&#xD558;&#xAC8C; &#xB418;&#xB294; &#xACBD;&#xC6B0;&#xAC00; &#xBC1C;&#xC0DD;&#xD55C;&#xB2E4;.</li>
<li>&#xB3C4;&#xBA54;&#xC778; &#xBAA8;&#xB378; &#xC804;&#xCCB4;&#xB97C; &#xBD10;&#xC57C; &#xAC01; &#xBAA8;&#xB378;&#xB4E4;&#xC758; &#xAD00;&#xACC4;, &#xD558;&#xC704; &#xAC1C;&#xBCC4; &#xBAA8;&#xB378;&#xB4E4;&#xC744; &#xC774;&#xD574;&#xD558;&#xAE30; &#xC27D;&#xB2E4;.</li>
<li>&#xC560;&#xADF8;&#xB9AC;&#xAC70;&#xD2B8;&#xB294; &#xAD00;&#xB828; &#xAC1D;&#xCCB4;&#xB97C; &#xD558;&#xB098;&#xB85C; &#xBB36;&#xC5B4; &#xB3C4;&#xBA54;&#xC778; &#xBAA8;&#xB378;&#xC744; &#xC0C1;&#xC704; &#xC218;&#xC900;&#xC5D0;&#xC11C; &#xC774;&#xD574;&#xD558;&#xB294; &#xAC83;&#xC744; &#xB3D5;&#xB294;&#xB2E4;.</li>
<li>&#xC560;&#xADF8;&#xB9AC;&#xAC70;&#xD2B8;&#xB294; &#xD574;&#xB2F9; &#xAD70;&#xC9D1;&#xC5D0; &#xC18D;&#xD55C; &#xAC1D;&#xCCB4;&#xB4E4;&#xC744; &#xAD00;&#xB9AC;&#xD558;&#xB294; &#xB8E8;&#xD2B8; &#xC5D4;&#xD2F0;&#xD2F0;&#xB97C; &#xAC16;&#xB294;&#xB2E4;. (&#xC560;&#xADF8;&#xB9AC;&#xAC70;&#xD2B8; &#xB8E8;&#xD2B8;)<ul>
<li>&#xB8E8;&#xD2B8; &#xC5D4;&#xD2F0;&#xD2F0;&#xC5D0;&#xC11C; &#xD574;&#xB2F9; &#xC560;&#xADF8;&#xB9AC;&#xAC70;&#xD2B8;&#xC5D0; &#xC18D;&#xD574; &#xC788;&#xB294; &#xC5D4;&#xD2F0;&#xD2F0;&#xC640; &#xBC38;&#xB958; &#xAC1D;&#xCCB4;&#xB97C; &#xC774;&#xC6A9;&#xD574; &#xC560;&#xADF8;&#xB9AC;&#xAC70;&#xD2B8;&#xAC00; &#xAD6C;&#xD604;&#xD574;&#xC57C;&#xD560; &#xB3C4;&#xBA54;&#xC778;&#xC758; &#xAE30;&#xB2A5;&#xC744; &#xC81C;&#xACF5; (&#xCEA1;&#xC290;&#xD654;)</li>
<li>&#xC560;&#xADF8;&#xB9AC;&#xAC70;&#xD2B8; &#xC0AC;&#xC6A9; &#xCE21;&#xC5D0;&#xC11C;&#xB294; &#xC560;&#xADF8;&#xB9AC;&#xAC70;&#xD2B8; &#xB8E8;&#xD2B8;&#xB97C; &#xD1B5;&#xD574;&#xC11C;&#xB9CC; &#xD574;&#xB2F9; &#xC560;&#xADF8;&#xB9AC;&#xCEE4;&#xD2B8; &#xB0B4; &#xB2E4;&#xB978; &#xBC38;&#xB958; &#xAC1D;&#xCCB4;&#xC5D0; &#xC811;&#xADFC; (&#xCC45; 60P)</li>
</ul>
</li>
</ul>
<blockquote>
<p>OOP&#xC5D0;&#xC11C; &#xAC1D;&#xCCB4;&#xC758; &#xCEA1;&#xC290;&#xD654;&#xC640; &#xC560;&#xADF8;&#xB9AC;&#xAC70;&#xD2B8;&#xB97C; &#xB300;&#xC870;&#xD574; &#xC0DD;&#xAC01;&#xD574;&#xBCF4;&#xBA74; &#xC880; &#xB354; &#xC774;&#xD574;&#xAC00; &#xC27D;&#xB2E4;.</p>
<ul>
<li>&#xAC1D;&#xCCB4;&#xC758; &#xD544;&#xB4DC;(&#xC18D;&#xC131;), &#xBA54;&#xC18C;&#xB4DC;&#xB97C; &#xD558;&#xB098;&#xB85C; &#xBB36;&#xACE0;, &#xC2E4;&#xC81C; &#xAD6C;&#xD604; &#xB0B4;&#xC6A9;&#xC744; &#xC678;&#xBD80;&#xC5D0; &#xAC10;&#xCD94;&#xB294; &#xAC83;&#xC744; &#xB9D0;&#xD55C;&#xB2E4;. =&gt; &#xC560;&#xADF8;&#xB9AC;&#xAC70;&#xD2B8; &#xB8E8;&#xD2B8;&#xC774;&#xC678; &#xD558;&#xC704; &#xC5D4;&#xD2F0;&#xD2F0; &#xBC0F; &#xBC38;&#xB958;&#xB294; &#xB178;&#xCD9C;&#xD558;&#xC9C0; &#xC54A;&#xC74C;</li>
<li>&#xC678;&#xBD80; &#xAC1D;&#xCCB4;&#xB294; &#xAC1D;&#xCCB4; &#xB0B4;&#xBD80;&#xC758; &#xAD6C;&#xC870;&#xB97C; &#xC5BB;&#xC9C0; &#xBABB;&#xD558;&#xBA70; &#xAC1D;&#xCCB4;&#xAC00; &#xB178;&#xCD9C;&#xD574;&#xC11C; &#xC81C;&#xACF5;&#xD558;&#xB294; &#xD544;&#xB4DC;&#xC640; &#xBA54;&#xC18C;&#xB4DC;&#xB9CC; &#xC774;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xB2E4;. =&gt; &#xC560;&#xADF8;&#xB9AC;&#xAC70;&#xD2B8; &#xB8E8;&#xD2B8;&#xB97C; &#xD1B5;&#xD574;&#xC11C;&#xB9CC; &#xB3C4;&#xBA54;&#xC778; &#xAE30;&#xB2A5; &#xD638;&#xCD9C; &#xAC00;&#xB2A5;</li>
<li>&#xD544;&#xB4DC;&#xC640; &#xBA54;&#xC18C;&#xB4DC;&#xB97C; &#xCEA1;&#xC290;&#xD654;&#xD558;&#xC5EC; &#xBCF4;&#xD638;&#xD558;&#xB294; &#xC774;&#xC720;&#xB294; &#xC678;&#xBD80;&#xC758; &#xC798;&#xBABB;&#xB41C; &#xC0AC;&#xC6A9;&#xC73C;&#xB85C; &#xC778;&#xD574; &#xAC1D;&#xCCB4;&#xAC00; &#xC190;&#xC0C1;&#xB418;&#xC9C0; &#xC54A;&#xB3C4;&#xB85D; &#xD558;&#xB294;&#xB370; &#xC788;&#xB2E4;. =&gt; &#xC560;&#xADF8;&#xB9AC;&#xAC70;&#xD2B8;&#xC5D0; &#xB300;&#xD55C; &#xC870;&#xC791;&#xC744; &#xC758;&#xB3C4;&#xD55C; &#xBC29;&#xBC95;&#xB9CC;&#xC73C;&#xB85C;&#xB9CC; &#xAC00;&#xB2A5;&#xD558;&#xAC8C; &#xD568;</li>
</ul>
</blockquote>
<h4 id="&#xB9AC;&#xD3EC;&#xC9C0;&#xD130;&#xB9AC;">&#xB9AC;&#xD3EC;&#xC9C0;&#xD130;&#xB9AC;</h4>
<p>&#xB3C4;&#xBA54;&#xC778; &#xBAA8;&#xB378;&#xC744; &#xC9C0;&#xC18D;&#xC801;&#xC73C;&#xB85C; &#xC0AC;&#xC6A9;&#xD558;&#xB824;&#xBA74; RDBMS, NoSQL, &#xD30C;&#xC77C; &#xB4F1; &#xBB3C;&#xB9AC;&#xC801; &#xC800;&#xC7A5;&#xC18C;&#xC5D0; &#xC800;&#xC7A5;(&#xC601;&#xC18D;&#xD654;)&#xD574;&#xC57C;&#xD55C;&#xB2E4;. &#xC774;&#xB97C; &#xC704;&#xD55C; &#xB3C4;&#xBA54;&#xC778; &#xBAA8;&#xB378;&#xC774; &#xB9AC;&#xD3EC;&#xC9C0;&#xD130;&#xB9AC;&#xC774;&#xB2E4;.</p>
<ul>
<li>&#xC5D4;&#xD2F0;&#xD2F0;&#xC640; &#xBC38;&#xB958;&#xAC00; &#xC694;&#xAD6C;&#xC0AC;&#xD56D;&#xC5D0;&#xC11C; &#xB3C4;&#xCD9C;&#xB418;&#xB294; &#xBAA8;&#xB378;&#xC774;&#xB77C;&#xBA74;, &#xB9AC;&#xD3EC;&#xC9C0;&#xD130;&#xB9AC;&#xB294; &#xAD6C;&#xD604;&#xB2E8;&#xACC4;&#xC5D0;&#xC11C; &#xB3C4;&#xCD9C;&#xB418;&#xB294; &#xBAA8;&#xB378;</li>
<li>&#xC8FC;&#xBB38; &#xC560;&#xADF8;&#xB9AC;&#xAC70;&#xD2B8;&#xB97C; &#xC704;&#xD55C; &#xB9AC;&#xD3EC;&#xC9C0;&#xD130;&#xB9AC; &#xC608;&#xC2DC; <pre><code class="lang-java"><span class="hljs-keyword">public</span> inferface OrderRepository {
  <span class="hljs-function"><span class="hljs-keyword">public</span> Order <span class="hljs-title">findByNumber</span><span class="hljs-params">(OrderNumber number)</span></span>;
  <span class="hljs-function"><span class="hljs-keyword">public</span> <span class="hljs-keyword">void</span> <span class="hljs-title">save</span><span class="hljs-params">(Order order)</span></span>;
  <span class="hljs-function"><span class="hljs-keyword">public</span> <span class="hljs-keyword">void</span> <span class="hljs-title">delete</span><span class="hljs-params">(Order order)</span></span>;
}
</code></pre>
</li>
<li>&#xC704; &#xC608;&#xC2DC;&#xC5D0;&#xC11C; &#xB9AC;&#xD3EC;&#xC9C0;&#xD130;&#xB9AC;&#xC5D0;&#xC11C; &#xC870;&#xC791;&#xD558;&#xB294; &#xB3C4;&#xBA54;&#xC778; &#xBAA8;&#xB378;&#xC758; &#xB2E8;&#xC704;&#xAC00; &#xC8FC;&#xBB38; &#xC560;&#xADF8;&#xB9AC;&#xAC70;&#xD2B8; &#xB8E8;&#xD2B8;&#xC778; &#xC8FC;&#xBB38;(Order)&#xC774;&#xB2E4;.</li>
<li>&#xACB0;&#xACFC;&#xC801;&#xC73C;&#xB85C; &#xC8FC;&#xBB38; &#xC5D4;&#xD2F0;&#xD2F0;&#xB294; &#xC8FC;&#xBB38; &#xC560;&#xADF8;&#xB9AC;&#xAC70;&#xD2B8;&#xC5D0; &#xC18D;&#xD55C; &#xD558;&#xC704; &#xB3C4;&#xBA54;&#xC778; &#xBAA8;&#xB378;&#xB4E4;&#xC744; &#xC804;&#xBD80; &#xD3EC;&#xD568;&#xD558;&#xACE0; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC8FC;&#xBB38; &#xC560;&#xADF8;&#xB9AC;&#xAC70;&#xD2B8; &#xB2E8;&#xC704; &#xCC98;&#xB9AC;&#xAC00; &#xB41C;&#xB2E4;.</li>
<li><p>&#xC8FC;&#xBB38; &#xCDE8;&#xC18C; &#xAE30;&#xB2A5;&#xC744; &#xC81C;&#xACF5;&#xD558;&#xB294; &#xC751;&#xC6A9; &#xC11C;&#xBE44;&#xC2A4; &#xC608;&#xC2DC;</p>
<pre><code class="lang-java"><span class="hljs-keyword">public</span> <span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">CancelOrderService</span> </span>{
  <span class="hljs-keyword">private</span> OrderRepository orderRepository;

  <span class="hljs-function"><span class="hljs-keyword">public</span> <span class="hljs-keyword">void</span> <span class="hljs-title">cancel</span><span class="hljs-params">(OrderNumber number)</span> </span>{
      <span class="hljs-comment">// &#xB9AC;&#xD3EC;&#xC9C0;&#xD130;&#xB9AC;&#xB97C; &#xD1B5;&#xD574; &#xB3C4;&#xBA54;&#xC778; &#xAC1D;&#xCCB4; &#xC870;&#xD68C;</span>
      Order order = orderRepository.findByNumber(number);
      <span class="hljs-keyword">if</span> (order == <span class="hljs-keyword">null</span>) <span class="hljs-keyword">throw</span> <span class="hljs-keyword">new</span> NoOrderException(number);

      <span class="hljs-comment">// &#xB3C4;&#xBA54;&#xC778; &#xAC1D;&#xCCB4;&#xC5D0; &#xAD6C;&#xD604;&#xB41C; &#xCDE8;&#xC18C; &#xAE30;&#xB2A5; &#xC2E4;&#xD589;</span>
      order.cancel();
  }
}
</code></pre>
</li>
<li>&#xB3C4;&#xBA54;&#xC778; &#xBAA8;&#xB378; &#xAD00;&#xC810;&#xC5D0;&#xC11C; OrderRepository&#xB294; &#xB3C4;&#xBA54;&#xC778; &#xAC1D;&#xCCB4;&#xB97C; &#xC601;&#xC18D;&#xD654; &#xD558;&#xB294;&#xB370; &#xD544;&#xC694;&#xD55C; &#xAE30;&#xB2A5;&#xC744; interface&#xB85C; &#xCD94;&#xC0C1;&#xD654;&#xD55C; &#xAC83;&#xC73C;&#xB85C; &#xACE0;&#xC218;&#xC900; &#xBAA8;&#xB4C8;&#xC5D0; &#xC18D;&#xD568; (&#xCC45; 63p)</li>
<li>&#xC2E4;&#xC81C;&#xB85C; JPA &#xB4F1;&#xC73C;&#xB85C; OrderRepositofy&#xB97C; &#xAD6C;&#xD604;(implement)&#xD558;&#xB294; &#xD074;&#xB798;&#xC2A4;&#xB294; &#xC800;&#xC218;&#xC900; &#xBAA8;&#xB4C8;&#xB85C; &#xC778;&#xD504;&#xB77C; &#xC601;&#xC5ED;&#xC5D0; &#xC18D;&#xD55C;&#xB2E4;.</li>
<li><p>&#xC2A4;&#xD504;&#xB9C1; &#xD504;&#xB808;&#xC784;&#xC6CC;&#xD06C;&#xB97C; &#xC0AC;&#xC6A9;&#xD55C;&#xB2E4;&#xBA74; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC774; &#xC751;&#xC6A9; &#xC11C;&#xBE44;&#xC2A4;&#xB97C; &#xAD6C;&#xC131;&#xD560; &#xC218; &#xC788;&#xB2E4;.</p>
<pre><code class="lang-java"><span class="hljs-meta">@Configuration</span>
<span class="hljs-keyword">public</span> <span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">OrderServiceConfig</span> </span>{
  <span class="hljs-meta">@Autowired</span>
  <span class="hljs-keyword">private</span> OrderRepository orderRepository;

  <span class="hljs-meta">@Bean</span>
  <span class="hljs-function"><span class="hljs-keyword">public</span> CancelOrderService <span class="hljs-title">cancelOrderService</span><span class="hljs-params">()</span> </span>{
      <span class="hljs-keyword">return</span> <span class="hljs-keyword">new</span> CancelOrderService(orderRepository);
  }
}
</code></pre>
<pre><code class="lang-java"><span class="hljs-meta">@Configuration</span>
<span class="hljs-keyword">public</span> <span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">RepositoryConfig</span> </span>{
  <span class="hljs-meta">@Bean</span>
  <span class="hljs-function"><span class="hljs-keyword">public</span> JpaOrderRepository <span class="hljs-title">orderRepository</span><span class="hljs-params">()</span> </span>{
      <span class="hljs-keyword">return</span> <span class="hljs-keyword">new</span> JpaOrderRepository();
  }

  <span class="hljs-meta">@Bean</span>
  <span class="hljs-function"><span class="hljs-keyword">public</span> LocalContainerEntityManagerFactoryBean <span class="hljs-title">emf</span><span class="hljs-params">()</span> </span>{
      ...
  }
}
</code></pre>
</li>
<li><p>&#xC751;&#xC6A9; &#xC11C;&#xBE44;&#xC2A4;&#xC640; &#xB9AC;&#xD3EC;&#xC9C0;&#xD130;&#xB9AC;&#xB294; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC740; &#xC774;&#xC720;&#xB85C; &#xBC00;&#xC811;&#xD55C; &#xC5F0;&#xAD00;&#xC774; &#xC788;&#xB2E4;.</p>
<ul>
<li>&#xC751;&#xC6A9; &#xC11C;&#xBE44;&#xC2A4;&#xB294; &#xD544;&#xC694;&#xD55C; &#xB3C4;&#xBA54;&#xC778; &#xAC1D;&#xCCB4;&#xB97C; &#xAD6C;&#xD558;&#xAC70;&#xB098; &#xC800;&#xC7A5;&#xD558;&#xAE30; &#xC704;&#xD574; &#xB9AC;&#xD3EC;&#xC9C0;&#xD130;&#xB9AC;&#xB97C; &#xC0AC;&#xC6A9;</li>
<li>&#xC751;&#xC6A9; &#xC11C;&#xBE44;&#xC2A4;&#xB294; &#xD2B8;&#xB79C;&#xC7AD;&#xC158;&#xC744; &#xAD00;&#xB9AC;&#xD558;&#xB294;&#xB370;, &#xD2B8;&#xB79C;&#xC7AD;&#xC158; &#xCC98;&#xB9AC;&#xB294; &#xB9AC;&#xD3EC;&#xC9C0;&#xD130;&#xB9AC; &#xAD6C;&#xD604; &#xAE30;&#xC220;&#xC5D0; &#xC601;&#xD5A5;&#xC744; &#xBC1B;&#xC74C; </li>
</ul>
</li>
<li>&#xB9AC;&#xD3EC;&#xC9C0;&#xD130;&#xB9AC;&#xC758; &#xC0AC;&#xC6A9; &#xC8FC;&#xCCB4;&#xAC00; &#xC751;&#xC6A9; &#xC11C;&#xBE44;&#xC2A4;&#xC774;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xB9AC;&#xD3EC;&#xC9C0;&#xD130;&#xB9AC;&#xB294; &#xC751;&#xC6A9; &#xC11C;&#xBE44;&#xC2A4;&#xAC00; &#xD544;&#xC694;&#xB85C; &#xD558;&#xB294; &#xBA54;&#xC11C;&#xB4DC;&#xB97C; &#xC81C;&#xACF5;<ul>
<li>&#xC560;&#xADF8;&#xB9AC;&#xAC70;&#xD2B8;&#xB97C; &#xC800;&#xC7A5;&#xD558;&#xB294; &#xBA54;&#xC11C;&#xB4DC; <code>void save(Aggregate agg)</code></li>
<li>&#xC560;&#xADF8;&#xB9AC;&#xAC70;&#xD2B8;&#xB97C; &#xC800;&#xC7A5;&#xD558;&#xB294; &#xBA54;&#xC11C;&#xB4DC; <code>Aggregate findById(SomeId id)</code></li>
<li>&#xD544;&#xC694;&#xC5D0; &#xB530;&#xB77C; <code>delete</code>, <code>counts</code> &#xB4F1; &#xCD94;&#xAC00; &#xAE30;&#xB2A5; &#xC81C;&#xACF5;</li>
</ul>
</li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="1.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: 1. 도메인 모델 시작">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"2. 아키텍쳐 개요","level":"1.4.1.2","depth":3,"next":{"title":"3. 애그리거트","level":"1.4.1.3","depth":3,"ref":"","articles":[]},"previous":{"title":"1. 도메인 모델 시작","level":"1.4.1.1","depth":3,"path":"content/architecture/ddd-start!/1.md","ref":"content/architecture/ddd-start!/1.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["collapse","collapsible-menu"],"pluginsConfig":{"collapse":{},"collapsible-menu":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"content/architecture/ddd-start!/2.md","mtime":"2019-12-31T16:54:48.367Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-12-31T16:54:58.419Z"},"basePath":"../../..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../../../gitbook/gitbook.js"></script>
    <script src="../../../gitbook/theme.js"></script>
    
        
        <script src="../../../gitbook/gitbook-plugin-collapse/collapse.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-collapsible-menu/plugin.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

